app/Http/Controllers/Auth/AuthController.php

    public function login(Request $request)
    {
        $request->validate([
            'email'     => 'required|email',
            'password'  => 'required|string',
        ]);

        $user       = User::query()->firstWhere('email', $request->email);
---
select * from `users` where `email` = 'superadmin@bugbuild.com' limit 1