app/Http/Helpers/helper.php

select `value` from `settings` where `key` = 'language' limit 1
---
    function settings($key = "")
    {
        $settings = Cache::rememberForever("settings", fn () => Setting::pluck('value', 'key')->toArray());

select * from `uploads` where `uploads`.`id` = '18' limit 1
---
    function logo($upload_id = null)
    {
        $logo   = Upload::find($upload_id);

select * from `uploads` where `uploads`.`id` is null limit 1
---
    function favicon($upload_id = null)
    {
        $id = $upload_id ?? settings('favicon');

        $cacheKey = "favicon";

        $favicon = Cache::get($cacheKey);

        if ($favicon == null || !File::exists(public_path($favicon->original))) {
            Cache::forget($cacheKey);
            $favicon = Cache::rememberForever($cacheKey, fn () => Upload::find($id));

select * from `languages` where `code` = 'en' limit 1
---
    function defaultLanguage()
    {
        $app_local  = Session::get('locale') ?? settings('language');

        if ($app_local == '') {
            $app_local = 'en';
        }

        $cacheKey = "defaultLanguage-{$app_local}";

        if (Cache::has($cacheKey)) {

            $language = Cache::get($cacheKey);

            Cache::put($cacheKey, $language,  Carbon\Carbon::now()->addMinutes(5));  // Extend the cache expiration time by 5 minutes

            return  $language;
        }

        return Cache::remember($cacheKey, Carbon\Carbon::now()->addMinutes(10), fn () => Language::where('code', $app_local)->first());